name: "ensemble"
backend: "python"
max_batch_size: 0
input [
  {
    name: "INPUT_IMAGE"
    data_type: TYPE_UINT8    # ← Raw image pixels
    dims: [ -1, -1, 3 ]     # ← HWC (height, width, channels)
  }
]
output [
  {
    name: "ENSEMBLE_OUTPUT"
    data_type: TYPE_FP32
    dims: [ 5 ]             # ← Probabilities for 5 classes
  }
]
instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]